Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_TOUT_CTRL_Bits.TOUT_CNT */
#define IFX_SDMMC_TOUT_CTRL_TOUT_CNT_OFF (0u)

/** \brief Length for Ifx_SDMMC_SW_RST_Bits.SW_RST_ALL */
#define IFX_SDMMC_SW_RST_SW_RST_ALL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_SW_RST_Bits.SW_RST_ALL */
#define IFX_SDMMC_SW_RST_SW_RST_ALL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_SW_RST_Bits.SW_RST_ALL */
#define IFX_SDMMC_SW_RST_SW_RST_ALL_OFF (0u)

/** \brief Length for Ifx_SDMMC_SW_RST_Bits.SW_RST_CMD */
#define IFX_SDMMC_SW_RST_SW_RST_CMD_LEN (1u)

/** \brief Mask for Ifx_SDMMC_SW_RST_Bits.SW_RST_CMD */
#define IFX_SDMMC_SW_RST_SW_RST_CMD_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_SW_RST_Bits.SW_RST_CMD */
#define IFX_SDMMC_SW_RST_SW_RST_CMD_OFF (1u)

/** \brief Length for Ifx_SDMMC_SW_RST_Bits.SW_RST_DAT */
#define IFX_SDMMC_SW_RST_SW_RST_DAT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_SW_RST_Bits.SW_RST_DAT */
#define IFX_SDMMC_SW_RST_SW_RST_DAT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_SW_RST_Bits.SW_RST_DAT */
#define IFX_SDMMC_SW_RST_SW_RST_DAT_OFF (2u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CMD_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_CMD_COMPLETE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CMD_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_CMD_COMPLETE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CMD_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_CMD_COMPLETE_OFF (0u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.XFER_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_XFER_COMPLETE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.XFER_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_XFER_COMPLETE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.XFER_COMPLETE */
#define IFX_SDMMC_NORMAL_INT_STAT_XFER_COMPLETE_OFF (1u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BGAP_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_BGAP_EVENT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BGAP_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_BGAP_EVENT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BGAP_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_BGAP_EVENT_OFF (2u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.DMA_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_DMA_INTERRUPT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.DMA_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_DMA_INTERRUPT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.DMA_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_DMA_INTERRUPT_OFF (3u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_WR_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_WR_READY_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_WR_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_WR_READY_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_WR_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_WR_READY_OFF (4u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_RD_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_RD_READY_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_RD_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_RD_READY_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.BUF_RD_READY */
#define IFX_SDMMC_NORMAL_INT_STAT_BUF_RD_READY_OFF (5u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INSERTION */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INSERTION_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INSERTION */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INSERTION_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INSERTION */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INSERTION_OFF (6u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_REMOVAL */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_REMOVAL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_REMOVAL */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_REMOVAL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_REMOVAL */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_REMOVAL_OFF (7u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INTERRUPT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INTERRUPT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CARD_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_CARD_INTERRUPT_OFF (8u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_A */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_A_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_A */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_A_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_A */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_A_OFF (9u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_B */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_B_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_B */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_B_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_B */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_B_OFF (10u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_C */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_C_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_C */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_C_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.INT_C */
#define IFX_SDMMC_NORMAL_INT_STAT_INT_C_OFF (11u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.RE_TUNE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_RE_TUNE_EVENT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.RE_TUNE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_RE_TUNE_EVENT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.RE_TUNE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_RE_TUNE_EVENT_OFF (12u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.FX_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_FX_EVENT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.FX_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_FX_EVENT_MSK (0x1u)

