Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_END_BIT_ERR_SIGNAL_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_IDX_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_IDX_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_IDX_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_IDX_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CMD_IDX_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CMD_IDX_ERR_SIGNAL_EN_OFF (3u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_TOUT_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_TOUT_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_TOUT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_TOUT_ERR_SIGNAL_EN_OFF (4u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_CRC_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_CRC_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_CRC_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_CRC_ERR_SIGNAL_EN_OFF (5u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_END_BIT_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_END_BIT_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.DATA_END_BIT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_DATA_END_BIT_ERR_SIGNAL_EN_OFF (6u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CUR_LMT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CUR_LMT_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CUR_LMT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CUR_LMT_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.CUR_LMT_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_CUR_LMT_ERR_SIGNAL_EN_OFF (7u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.AUTO_CMD_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_AUTO_CMD_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.AUTO_CMD_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_AUTO_CMD_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.AUTO_CMD_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_AUTO_CMD_ERR_SIGNAL_EN_OFF (8u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.ADMA_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_ADMA_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.ADMA_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_ADMA_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.ADMA_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_ADMA_ERR_SIGNAL_EN_OFF (9u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.TUNING_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_TUNING_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.TUNING_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_TUNING_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.TUNING_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_TUNING_ERR_SIGNAL_EN_OFF (10u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.RESP_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_RESP_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.RESP_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_RESP_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.RESP_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_RESP_ERR_SIGNAL_EN_OFF (11u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.BOOT_ACK_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_BOOT_ACK_ERR_SIGNAL_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.BOOT_ACK_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_BOOT_ACK_ERR_SIGNAL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits.BOOT_ACK_ERR_SIGNAL_EN */
#define IFX_SDMMC_ERROR_INT_SIGNAL_EN_BOOT_ACK_ERR_SIGNAL_EN_OFF (12u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD12_NOT_EXEC_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD12_NOT_EXEC_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD12_NOT_EXEC */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD12_NOT_EXEC_OFF (0u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_TOUT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_TOUT_ERR_OFF (1u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_CRC_ERR_OFF (2u)

/** \brief Length for Ifx_SDMMC_AUTO_CMD_STAT_Bits.AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_AUTO_CMD_STAT_AUTO_CMD_EBIT_ERR_LEN (1u)

