Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN26 */
#define IFX_SDMMC_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN27 */
#define IFX_SDMMC_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN27 */
#define IFX_SDMMC_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN27 */
#define IFX_SDMMC_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN28 */
#define IFX_SDMMC_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN28 */
#define IFX_SDMMC_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN28 */
#define IFX_SDMMC_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN29 */
#define IFX_SDMMC_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN29 */
#define IFX_SDMMC_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN29 */
#define IFX_SDMMC_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN30 */
#define IFX_SDMMC_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN30 */
#define IFX_SDMMC_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN30 */
#define IFX_SDMMC_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_SDMMC_ACCEN0_Bits.EN31 */
#define IFX_SDMMC_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ACCEN0_Bits.EN31 */
#define IFX_SDMMC_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ACCEN0_Bits.EN31 */
#define IFX_SDMMC_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_SDMMC_KRST0_Bits.RST */
#define IFX_SDMMC_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_SDMMC_KRST0_Bits.RST */
#define IFX_SDMMC_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_KRST0_Bits.RST */
#define IFX_SDMMC_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_SDMMC_KRST0_Bits.RSTSTAT */
#define IFX_SDMMC_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_KRST0_Bits.RSTSTAT */
#define IFX_SDMMC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_KRST0_Bits.RSTSTAT */
#define IFX_SDMMC_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_SDMMC_KRST1_Bits.RST */
#define IFX_SDMMC_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_SDMMC_KRST1_Bits.RST */
#define IFX_SDMMC_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_KRST1_Bits.RST */
#define IFX_SDMMC_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_SDMMC_KRSTCLR_Bits.CLR */
#define IFX_SDMMC_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_KRSTCLR_Bits.CLR */
#define IFX_SDMMC_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_KRSTCLR_Bits.CLR */
#define IFX_SDMMC_KRSTCLR_CLR_OFF (0u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSDMMC_BF_H */
